yshome-hb/USBHost_CH559/src/USBHost.c
void resetHubDevices(unsigned char hubindex)
{
	 __xdata unsigned char hiddevice;
    VendorProductID[hubindex].idVendorL = 0;
    VendorProductID[hubindex].idVendorH = 0;
    VendorProductID[hubindex].idProductL = 0;
    VendorProductID[hubindex].idProductH = 0;
	for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
	{
		if(HIDdevice[hiddevice].rootHub == hubindex){
			HIDdevice[hiddevice].connected  = 0;
			HIDdevice[hiddevice].rootHub  = 0;
			HIDdevice[hiddevice].interface  = 0;
			HIDdevice[hiddevice].endPoint  = 0;
			HIDdevice[hiddevice].type[0]  = 0;
			HIDdevice[hiddevice].id[0]  = 0;
		}
	}
}

void pollHIDdevice()
{
	__xdata unsigned char i, s, hiddevice, len;
	__xdata unsigned char txData[16] = {0};
	for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
	{
		if(HIDdevice[hiddevice].connected)
		{
			selectHubPort(HIDdevice[hiddevice].rootHub, 0);
			s = hostTransfer( USB_PID_IN << 4 | HIDdevice[hiddevice].endPoint & 0x7F, HIDdevice[hiddevice].endPoint & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );
			if ( s == ERR_SUCCESS )
   			{
    			HIDdevice[hiddevice].endPoint ^= 0x80;
				len = USB_RX_LEN;
				if ( len )
				{
					for(i = 0; i < MAX_REPORT_USAGES; i++)
					{
						if(!HIDdevice[hiddevice].id[i] || (HIDdevice[hiddevice].id[i] == RxBuffer[0]))
						{
							break;
						}
					}

					YS_LOG("HID[%i](%lu), %i data %i\n", hiddevice, HIDdevice[hiddevice].type[i], RxBuffer[0]);
					if(!HIDdevice[hiddevice].id[i])
						memcpy(txData, RxBuffer, len);
					else
						memcpy(txData, RxBuffer+1, len-1);

					if(HIDdevice[hiddevice].type[i] == REPORT_USAGE_KEYBOARD)
						len = 8;
					else if(HIDdevice[hiddevice].type[i] == REPORT_USAGE_MOUSE)
						len = 5;

					Protocol_sendMsg(CMD_REPORT, txData, len);
				}
			}
		}
	}
}


void parseHIDDeviceReport(unsigned char __xdata *report, unsigned short length, unsigned char CurrentDevive)
{
	unsigned short i = 0;
	unsigned char level = 0;
	unsigned char usageId = 0;
	while(i < length)
	{
		unsigned char j;
		unsigned char id = report[i] & 0b11111100;
		unsigned char size = report[i] & 0b00000011;
		unsigned long data = 0;
		if(size == 3) size++;
		for(j = 0; j < size; j++)
			data |= ((unsigned long)report[i + 1 + j]) << (j * 8);
		for(j = 0; j < level - (id == REPORT_COLLECTION_END ? 1 : 0); j++)
			YS_LOG("    ");
		switch(id)
		{
			case REPORT_USAGE_PAGE:	//todo clean up defines (case)
			{
				unsigned long vd = data < REPORT_USAGE_PAGE_VENDOR ? data : REPORT_USAGE_PAGE_VENDOR;
				YS_LOG("Usage page ");
				switch(vd)
				{
					case REPORT_USAGE_PAGE_LEDS:
						YS_LOG("LEDs");
						if(HIDdevice[CurrentDevive].type[usageId-1] == REPORT_USAGE_KEYBOARD)
							HIDdevice[CurrentDevive].ledId = HIDdevice[CurrentDevive].id[usageId-1];
					break;
					case REPORT_USAGE_PAGE_KEYBOARD:
						YS_LOG("Keyboard/Keypad");
					break;
					case REPORT_USAGE_PAGE_BUTTON:
						YS_LOG("Button");
					break;
					case REPORT_USAGE_PAGE_GENERIC:
						YS_LOG("generic desktop controls");
					break;
					case REPORT_USAGE_PAGE_VENDOR:
						YS_LOG("vendor defined 0x%04lx", data);
					break;
					default:
						YS_LOG("unknown 0x%02lx", data);
				}
				YS_LOG("\n");
			}
			break;
			case REPORT_USAGE:
				if (!level && usageId < MAX_REPORT_USAGES){
					HIDdevice[CurrentDevive].type[usageId++] = data;
				}
				YS_LOG("Usage ");
				switch(data)
				{
					case REPORT_USAGE_UNKNOWN:
						YS_LOG("Unknown");
					break;
					case REPORT_USAGE_POINTER:
						YS_LOG("Pointer");
					break;
					case REPORT_USAGE_MOUSE:
						YS_LOG("Mouse");
					break;
					case REPORT_USAGE_RESERVED:
						YS_LOG("Reserved");
					break;
					case REPORT_USAGE_JOYSTICK:
						YS_LOG("Joystick");
					break;
					case REPORT_USAGE_GAMEPAD:
						YS_LOG("Gamepad");
					break;
					case REPORT_USAGE_KEYBOARD:
						YS_LOG("Keyboard");
					break;
					case REPORT_USAGE_KEYPAD:
						YS_LOG("Keypad");
					break;
					case REPORT_USAGE_MULTI_AXIS:
						YS_LOG("Multi-Axis controller");
					break;
					case REPORT_USAGE_SYSTEM:
						YS_LOG("Tablet system controls");
					break;

					case REPORT_USAGE_X:
						YS_LOG("X");
					break;
					case REPORT_USAGE_Y:
						YS_LOG("Y");
					break;
					case REPORT_USAGE_Z:
						YS_LOG("Z");
					break;
					case REPORT_USAGE_WHEEL:
						YS_LOG("Wheel");
					break;
					default:
						YS_LOG("unknown 0x%02lx", data);
				}
				YS_LOG("\n");
			break;
			case REPORT_LOCAL_MINIMUM:
				YS_LOG("Logical min %lu\n", data);
			break;
			case REPORT_LOCAL_MAXIMUM:
				YS_LOG("Logical max %lu\n", data);
			break;
			case REPORT_PHYSICAL_MINIMUM:
				YS_LOG("Physical min %lu\n", data);
			break;
			case REPORT_PHYSICAL_MAXIMUM:
				YS_LOG("Physical max %lu\n", data);
			break;
			case REPORT_USAGE_MINIMUM:
				YS_LOG("Physical min %lu\n", data);
			break;
			case REPORT_USAGE_MAXIMUM:
				YS_LOG("Physical max %lu\n", data);
			break;
			case REPORT_COLLECTION:
				YS_LOG("Collection start %lu\n", data);
				level++;
			break;
			case REPORT_COLLECTION_END:
				YS_LOG("Collection end %lu\n", data);
				level--;
			break;
			case REPORT_UNIT:
				YS_LOG("Unit 0x%02lx\n", data);
			break;
			case REPORT_INPUT:
				YS_LOG("Input 0x%02lx\n", data);
			break;
			case REPORT_OUTPUT:
				YS_LOG("Output 0x%02lx\n", data);
			break;
			case REPORT_FEATURE:
				YS_LOG("Feature 0x%02lx\n", data);
			break;
			case REPORT_REPORT_SIZE:
				YS_LOG("Report size %lu\n", data);
			break;
			case REPORT_REPORT_ID:
				YS_LOG("Report ID %lu\n", data);
				HIDdevice[CurrentDevive].id[usageId-1] = data;
			break;
			case REPORT_REPORT_COUNT:
				YS_LOG("Report count %lu\n", data);
			break;
			default:
				YS_LOG("Unknown HID report identifier: 0x%02x (%i bytes) data: 0x%02lx\n", id, size, data);
		};
		i += size + 1;
	}
}

unsigned char getHIDDeviceReport(unsigned char CurrentDevive)
{
 	unsigned char s;
	unsigned short len, i, reportLen = RECEIVE_BUFFER_LEN;
	YS_LOG("Requesting report from interface %i\n", HIDdevice[CurrentDevive].interface);

	fillTxBuffer(SetHIDIdleRequest, sizeof(SetHIDIdleRequest));
	((PXUSB_SETUP_REQ)TxBuffer)->wIndexL = HIDdevice[CurrentDevive].interface;	
	s = hostCtrlTransfer(receiveDataBuffer, &len, 0);
	
	//todo really dont care if successful? 8bitdo faild here
	//if(s != ERR_SUCCESS)
	//	return s;

	fillTxBuffer(GetHIDReport, sizeof(GetHIDReport));
	((PXUSB_SETUP_REQ)TxBuffer)->wIndexL = HIDdevice[CurrentDevive].interface;
	((PXUSB_SETUP_REQ)TxBuffer)->wLengthL = (unsigned char)(reportLen & 255); 
	((PXUSB_SETUP_REQ)TxBuffer)->wLengthH = (unsigned char)(reportLen >> 8);
	s = hostCtrlTransfer(receiveDataBuffer, &len, RECEIVE_BUFFER_LEN);
	if(s != ERR_SUCCESS)
		return s;
	
	for (i = 0; i < len; i++)
	{
		YS_LOG("0x%02X ", receiveDataBuffer[i]);
	}
	YS_LOG("\n");
	parseHIDDeviceReport(receiveDataBuffer, len, CurrentDevive);
	return (ERR_SUCCESS);
}

void readInterface(unsigned char rootHubIndex, PXUSB_ITF_DESCR interface)
{
	unsigned char temp = rootHubIndex;
	YS_LOG("Interface %d\n", interface->bInterfaceNumber);
	YS_LOG("  Class %d\n", interface->bInterfaceClass);
	YS_LOG("  Sub Class %d\n", interface->bInterfaceSubClass);
	YS_LOG("  Interface Protocol %d\n", interface->bInterfaceProtocol);
}

void readHIDInterface(PXUSB_ITF_DESCR interface, PXUSB_HID_DESCR descriptor)
{
	YS_LOG("HID at Interface %d\n", interface->bInterfaceNumber);
	YS_LOG("  USB %d.%d%d\n", (descriptor->bcdHIDH & 15), (descriptor->bcdHIDL >> 4), (descriptor->bcdHIDL & 15));
	YS_LOG("  Country code 0x%02X\n", descriptor->bCountryCode);
	YS_LOG("  TypeX 0x%02X\n", descriptor->bDescriptorTypeX);
}

void readEndpoint()
{
}

unsigned char initializeRootHubConnection(unsigned char rootHubIndex)
{
	unsigned char retry, i, s = ERR_SUCCESS, cfg, dv_cls, addr;
	unsigned char HIDDevice = 0;

	for(retry = 0; retry < 10; retry++) //todo test fewer retries
	{
		delayMs(100);
		delayMs(100); //todo test lower delay
		resetHubDevices(rootHubIndex);
		resetRootHubPort(rootHubIndex);                      
		for (i = 0; i < 100; i++) //todo test fewer retries
		{
			delayMs(1);
			if (enableRootHubPort(rootHubIndex) == ERR_SUCCESS)  
				break;
		}
		if (i == 100)                                              
		{
			disableRootHubPort(rootHubIndex);
			YS_LOG("Failed to enable root hub port %i\n", rootHubIndex);
			continue;
		}

		selectHubPort(rootHubIndex, 0);
		YS_LOG("root hub port %i enabled\n", rootHubIndex);
		s = getDeviceDescriptor();
                              
		if ( s == ERR_SUCCESS )
		{
			dv_cls = ((PXUSB_DEV_DESCR)receiveDataBuffer)->bDeviceClass;
			YS_LOG( "Device class %i\n", dv_cls);
			YS_LOG( "Max packet size %i\n", ((PXUSB_DEV_DESCR)receiveDataBuffer)->bMaxPacketSize0);
    		VendorProductID[rootHubIndex].idVendorL = ((PXUSB_DEV_DESCR)receiveDataBuffer)->idVendorL;
    		VendorProductID[rootHubIndex].idVendorH = ((PXUSB_DEV_DESCR)receiveDataBuffer)->idVendorH;
    		VendorProductID[rootHubIndex].idProductL = ((PXUSB_DEV_DESCR)receiveDataBuffer)->idProductL;
    		VendorProductID[rootHubIndex].idProductH = ((PXUSB_DEV_DESCR)receiveDataBuffer)->idProductH;
			YS_LOG_USB_BUFFER(receiveDataBuffer);
			addr = rootHubIndex + ((PUSB_SETUP_REQ)SetUSBAddressRequest)->wValueL; //todo wValue always 2.. does another id work?
			s = setUsbAddress(addr);
			if ( s == ERR_SUCCESS )
			{
				rootHubDevice[rootHubIndex].address = addr;
				s = getDeviceString();
				{
					YS_LOG_USB_BUFFER(receiveDataBuffer);
					if(convertStringDescriptor(receiveDataBuffer, receiveDataBuffer, RECEIVE_BUFFER_LEN,rootHubIndex))
					{
						YS_LOG("Device String: %s\n", receiveDataBuffer);
					}
					s = getConfigurationDescriptor();
					if ( s == ERR_SUCCESS )
					{
						unsigned short i, total;
						unsigned char __xdata temp[512];
						PXUSB_ITF_DESCR currentInterface = 0;
						int interfaces;
						//YS_LOG_USB_BUFFER(receiveDataBuffer);
						for(i = 0; i < receiveDataBuffer[2] + (receiveDataBuffer[3] << 8); i++)
						{
							YS_LOG("0x%02X ", (uint16_t)(receiveDataBuffer[i]));
						}
						YS_LOG("\n");

						cfg = ((PXUSB_CFG_DESCR)receiveDataBuffer)->bConfigurationValue;
						YS_LOG("Configuration value: %d\n", cfg);

						interfaces = ((PXUSB_CFG_DESCR_LONG)receiveDataBuffer)->cfg_descr.bNumInterfaces;
						YS_LOG("Interface count: %d\n", interfaces);

    					s = setUsbConfig( cfg ); 
						//parse descriptors
						total = ((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthL + (((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthH << 8);
						for(i = 0; i < total; i++)
							temp[i] = receiveDataBuffer[i];
						i = ((PXUSB_CFG_DESCR)receiveDataBuffer)->bLength;
						while(i < total)
						{
							unsigned char __xdata *desc = &(temp[i]);
							switch(desc[1])
							{
								case USB_DESCR_TYP_INTERF:
									YS_LOG("Interface descriptor found\n", desc[1]);
									//YS_LOG_USB_BUFFER(desc);
									currentInterface = ((PXUSB_ITF_DESCR)desc);
									readInterface(rootHubIndex, currentInterface);
									break;
								case USB_DESCR_TYP_ENDP:
									YS_LOG("Endpoint descriptor found\n", desc[1]);
									YS_LOG_USB_BUFFER(desc);
									if(currentInterface->bInterfaceClass == USB_DEV_CLASS_HID)
									{
										PXUSB_ENDP_DESCR d = (PXUSB_ENDP_DESCR)desc;
										if(d->bEndpointAddress & 0x80){
											unsigned char hiddevice;
											for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
											{
												if(HIDdevice[hiddevice].connected == 0)break;
											}
											YS_LOG("Connected device at position: %i\n", hiddevice);
											HIDdevice[hiddevice].endPoint = d->bEndpointAddress;
											HIDdevice[hiddevice].connected = 1;										
											HIDdevice[hiddevice].interface = currentInterface->bInterfaceNumber;
											HIDdevice[hiddevice].rootHub = rootHubIndex;
											YS_LOG("Got endpoint for the HIDdevice 0x%02x\n", HIDdevice[hiddevice].endPoint);
											getHIDDeviceReport(hiddevice);
										}
									}
									break;
								case USB_DESCR_TYP_HID:
									YS_LOG("HID descriptor found\n", desc[1]);
									//YS_LOG_USB_BUFFER(desc);
									if(currentInterface == 0) break;
									readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
									break;
								case USB_DESCR_TYP_CS_INTF:
									YS_LOG("Class specific header descriptor found\n", desc[1]);
									YS_LOG_USB_BUFFER(desc);
									//if(currentInterface == 0) break;
									//readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
									break;
								case USB_DESCR_TYP_CS_ENDP:
									YS_LOG("Class specific endpoint descriptor found\n", desc[1]);
									YS_LOG_USB_BUFFER(desc);
									//if(currentInterface == 0) break;
									//readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
									break;
								default:
									YS_LOG("Unexpected descriptor type: %02X\n", desc[1]);
									YS_LOG_USB_BUFFER(desc);
							}
							i += desc[0];
						}
						return ERR_SUCCESS;
					}			
				}
			}
		}
		YS_LOG( "Error = %02X\n", s);
		//sendProtocolMSG(MSG_TYPE_ERROR, 1, &s);
		rootHubDevice[rootHubIndex].status = ROOT_DEVICE_FAILED;
		setUsbSpeed(1);	//TODO define speeds
	}
	return s;
}

unsigned char checkRootHubConnections()
{
	unsigned char s = ERR_SUCCESS;
	if (UIF_DETECT)                                                        
	{
		UIF_DETECT = 0;    
		if(USB_HUB_ST & bUHS_H0_ATTACH)
		{
			if(rootHubDevice[0].status == ROOT_DEVICE_DISCONNECT || (UHUB0_CTRL & bUH_PORT_EN) == 0x00)
			{
				disableRootHubPort(0);	//todo really need to reset register?
				rootHubDevice[0].status = ROOT_DEVICE_CONNECTED;
				YS_LOG("Device at root hub %i connected\n", 0);
				s = initializeRootHubConnection(0);
			}
		}
		else if(rootHubDevice[0].status >= ROOT_DEVICE_CONNECTED)
		{
    		resetHubDevices(0);
			disableRootHubPort(0);
			YS_LOG("Device at root hub %i disconnected\n", 0);
			Protocol_sendMsg(CMD_REPORT, 0, 0);
			s = ERR_USB_DISCON;
		}

		if(USB_HUB_ST & bUHS_H1_ATTACH)
		{
			if(rootHubDevice[1].status == ROOT_DEVICE_DISCONNECT || (UHUB1_CTRL & bUH_PORT_EN) == 0x00)
			{
				disableRootHubPort(1);	//todo really need to reset register?
				rootHubDevice[1].status = ROOT_DEVICE_CONNECTED;
				YS_LOG("Device at root hub %i connected\n", 1);
				s = initializeRootHubConnection(1);
			}
		}
		else if(rootHubDevice[1].status >= ROOT_DEVICE_CONNECTED)
		{
    		resetHubDevices(1);
			disableRootHubPort(1);
			YS_LOG("Device at root hub %i disconnected\n", 1);
			Protocol_sendMsg(CMD_REPORT, 0, 0);
			s = ERR_USB_DISCON;
		}
	}
	return s;
}